
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОсновныеНачисления
	Движения.ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеНачисления Из ОсновныеНачисления Цикл
		Движение = Движения.ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаОсновныеНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаОсновныеНачисления.ПериодДействияНачало;
		Движение.ПериодДействияКонец = ТекСтрокаОсновныеНачисления.ПериодДействияКонец;
		Движение.ПериодРегистрации = ПериодРасчета;
		Движение.Сотрудник = ТекСтрокаОсновныеНачисления.Сотрудник;
		Движение.Дожность = ТекСтрокаОсновныеНачисления.Должность;
		Движение.ГрафикРаботы = ТекСтрокаОсновныеНачисления.ГрафикРаботы;
		Движение.Размер = ТекСтрокаОсновныеНачисления.Размер;

	КонецЦикла;

	// регистр ДополнительныеНачисления
	Движения.ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаДополнительныеНачисления Из ДополнительныеНачисления Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаДополнительныеНачисления.ВидРасчета;
		Движение.ПериодРегистрации = ПериодРасчета;
		Движение.БазовыйПериодНачало = НачалоМесяца(ПериодРасчета);
		Движение.БазовыйПериодКонец = КонецМесяца(ПериодРасчета);
		Движение.Сотрудник = ТекСтрокаДополнительныеНачисления.Сотрудник;
		Движение.Должность = ТекСтрокаДополнительныеНачисления.Должность;
		Движение.Размер = ТекСтрокаДополнительныеНачисления.Размер;
	КонецЦикла;
	Движения.Записать();

	//Оклад
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК ЗначениеПериодДействия,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ЗначениеФактическийПериодДействия,
		|	ЕСТЬNULL(ОкладыДолжностиСрезПоследних.Оклад, 0) КАК Оклад
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОкладыДолжности.СрезПоследних(&Дата, ) КАК ОкладыДолжностиСрезПоследних
		|		ПО ОсновныеНачисленияДанныеГрафика.Дожность = ОкладыДолжностиСрезПоследних.Должность";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.ОплатаПоОкладу);
     Запрос.УстановитьПараметр("Дата", Дата);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Для каждого СтрокаТЧ из Движения.ОсновныеНачисления Цикл
		 
		 Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.ОплатаПоОкладу Тогда
			 Продолжить;
		 КонецЕсли;  
		 
		 Выборка.Сбросить();
		 Выборка.НайтиСледующий(СтрокаТч.НомерСтроки, "НомерСтроки");
		 Если ЗначениеЗаполнено(Выборка.ЗначениеФактическийПериодДействия) Тогда
			 СтрокаТч.Результат = Выборка.Оклад / Выборка.ЗначениеПериодДействия * Выборка.ЗначениеФактическийПериодДействия;
		 Иначе 
			СтрокаТч.Результат = 0; 
		 КОнецЕсли;
	 КонецЦикла;
     Движения.ОсновныеНачисления.Записать();
	 
	 
	 	//Отпуск
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК ЗначениеПериодДействия,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ЗначениеФактическийПериодДействия,
		|	ОсновныеНачисленияДанныеГрафика.Размер КАК Размер
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.Отпуск);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Для каждого СтрокаТЧ из Движения.ОсновныеНачисления Цикл
		 
		 Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.Отпуск Тогда
			 Продолжить;
		 КонецЕсли;  
		 
		 Выборка.Сбросить();
		 Выборка.НайтиСледующий(СтрокаТч.НомерСтроки, "НомерСтроки");
		 
		 СтрокаТч.Результат = Выборка.Размер * Выборка.ЗначениеПериодДействия;
			 
	 КонецЦикла;
    Движения.ОсновныеНачисления.Записать();
	 
	 //Больничный
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК ЗначениеПериодДействия,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК ЗначениеФактическийПериодДействия,
		|	ОсновныеНачисленияДанныеГрафика.Размер КАК Размер
		|ИЗ
		|	РегистрРасчета.ОсновныеНачисления.ДанныеГрафика(
		|			Регистратор = &Ссылка
		|				И ВидРасчета = &ВидРасчета) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ОсновныеНачисления.БольничныйЛист);
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 Для каждого СтрокаТЧ из Движения.ОсновныеНачисления Цикл
		 
		 Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ОсновныеНачисления.БольничныйЛист Тогда
			 Продолжить;
		 КонецЕсли;  
		 
		 Выборка.Сбросить();
		 Выборка.НайтиСледующий(СтрокаТч.НомерСтроки, "НомерСтроки");
		 
		 СтрокаТч.Результат = Выборка.Размер * Выборка.ЗначениеПериодДействия;
			 
	 КонецЦикла;
     Движения.ОсновныеНачисления.Записать();
	 
	   //Дополнительные начисления
//Премия
	Запрос = Новый Запрос;
	Запрос.Текст = 		"ВЫБРАТЬ		|	ДополнительныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,		|	ДополнительныеНачисленияБазаОсновныеНачисления.РезультатБаза КАК РезультатБаза		|ИЗ		|	РегистрРасчета.ДополнительныеНачисления.БазаОсновныеНачисления(		|			&ИзмеренияОсновногоРегистра,		|			&ИзмеренияБазовогоРегистра,		|			,		|			Регистратор = &Ссылка		|				И ВидРасчета = &ВидРасчета) КАК ДополнительныеНачисленияБазаОсновныеНачисления";

	ИзмеренияОсновные = Новый Массив;	ИзмеренияОсновные.Добавить("Сотрудник");	ИзмеренияБазовые = Новый Массив;	ИзмеренияБазовые.Добавить("Сотрудник");	Запрос.УстановитьПараметр("ИзмеренияОсновногоРегистра", ИзмеренияОсновные);	Запрос.УстановитьПараметр("ИзмеренияБазовогоРегистра", ИзмеренияБазовые);	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ДополнительныеНачисления.Премия);	Запрос.УстановитьПараметр("Ссылка", Ссылка);		РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для каждого СтрокаТЧ из Движения.ДополнительныеНачисления Цикл
		 
		 Если СтрокаТЧ.ВидРасчета <> ПланыВидовРасчета.ДополнительныеНачисления.Премия Тогда
			 Продолжить;
		 КонецЕсли;  
		 
		 ВыборкаДетальныеЗаписи.Сбросить();
		 ВыборкаДетальныеЗаписи.НайтиСледующий(СтрокаТч.НомерСтроки, "НомерСтроки");
		 
		 СтрокаТч.Результат = ВыборкаДетальныеЗаписи.РезультатБаза * СтрокаТЧ.Размер / 100;
			 
	 КонецЦикла;
	 Движения.ДополнительныеНачисления.Записать()
 
КонецПроцедуры 


