Функция ТекущаяЦенаУслуги(Услуга) Экспорт	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЦеныУслугСрезПоследних.Цена КАК Цена,	
		|	ЦеныУслугСрезПоследних.Услуга КАК Услуга
   		 |ИЗ
		|	РегистрСведений.ЦеныУслуг.СрезПоследних КАК ЦеныУслугСрезПоследних
		|ГДЕ
		|	ЦеныУслугСрезПоследних.Услуга = &Услуга";		Запрос.УстановитьПараметр("Услуга", Услуга);		РезультатЗапроса = Запрос.Выполнить();		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл				Возврат ВыборкаДетальныеЗаписи.Цена;				КонецЦикла;		Возврат 0;	КонецФункции 