
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦенаНомернойФонд
	Движения.ЦенаНомернойФонд.Записывать = Истина;
	Движение = Движения.ЦенаНомернойФонд.Добавить();
	Движение.Период = Дата;
	Движение.НомернойФонд = НомернойФонд;
	Движение.Цена = Цена;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
