
&НаСервере
Процедура НомернойФондПриИзмененииНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦенаНомернойФондСрезПоследних.НомернойФонд КАК НомернойФонд,
		|	ЦенаНомернойФондСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦенаНомернойФонд.СрезПоследних КАК ЦенаНомернойФондСрезПоследних
		|ГДЕ
		|	ЦенаНомернойФондСрезПоследних.НомернойФонд = &НомернойФонд";
	
	Запрос.УстановитьПараметр("НомернойФонд", Объект.НомернойФонд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Объект.Цена = ВыборкаДетальныеЗаписи.Цена; 
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
КонецПроцедуры

&НаКлиенте
Процедура НомернойФондПриИзменении(Элемент)
	НомернойФондПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеУслугиУслугиПриИзменении(Элемент)   
	ТекущиеДанные = Элементы.ДополнительныеУслуги.ТекущиеДанные;	Услуга = ТекущиеДанные.Услуга;                   
	       	Цена = ОбработкаТабличнойЧастиВызовСервера.ТекущаяЦенаУслуги(Услуга);		ТекущиеДанные.Цена = Цена;	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеУслугиКоличествоПриИзменении(Элемент) 
	
		ТекущиеДанные = Элементы.ДополнительныеУслуги.ТекущиеДанные;
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество; 
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Менеджер = Пользователи.ТекущийПользователь();
	КонецЕсли; 
	
		Элементы.НомернойФонд.ТолькоПросмотр = Объект.Проведен;
		Элементы.Клиент.ТолькоПросмотр = Объект.Проведен;
		Элементы.ИнформацияОДатах.ТолькоПросмотр = Объект.Проведен;
		
		ЗаполнитьСписокУслуг()
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокУслуг()
  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Объект.СписокУслуг.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныУслугСрезПоследних.Услуга КАК Услуга,
		|	ЦеныУслугСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныУслуг.СрезПоследних(&Дата, ) КАК ЦеныУслугСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
        НоваяСтрока = Объект.СписокУслуг.Добавить();		НоваяСтрока.Услуга = Выборка.Услуга;		НоваяСтрока.Цена = Выборка.Цена;	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


#Область ОбработчикиКомандФормы
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
#КонецОбласти 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбщаяСумма = Объект.Цена;		Для Каждого Строка Из Объект.ДополнительныеУслуги Цикл		ОбщаяСумма = ОбщаяСумма + Строка.Сумма;	КонецЦикла;		Объект.Сумма = ОбщаяСумма; 
	Объект.СвободныеНомера.Очистить();
КонецПроцедуры

&НаКлиентеПроцедура ПоказатьСвободныеНомера(Команда)    ПоказатьСвободныеНомераНаСервере();КонецПроцедуры&НаСервереПроцедура ПоказатьСвободныеНомераНаСервере()        // Очищаем таблицу на закладке    Объект.СвободныеНомера.Очистить(); 		Запрос = Новый Запрос;    Запрос.Текст =        "ВЫБРАТЬ РАЗЛИЧНЫЕ       |	Номер.Ссылка КАК Ссылка,       |	Номер.Этаж КАК Этаж,       |	Номер.Категория КАК Категория,       |	Номер.КоличествоГостей КАК КоличествоГостей,       |	Цены.Цена КАК Цена       |ИЗ       |	Справочник.НомернойФонд КАК Номер       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БронированиеНомернойФонд КАК Бронь       |		ПО Номер.Ссылка = Бронь.НомернойФонд       |			И Бронь.Дата МЕЖДУ &ДатаЗаезда И &ДатаВыезда       |			И Бронь.Забронировано = ИСТИНА       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦенаНомернойФонд.СрезПоследних(&ДатаЗаезда) КАК Цены       |		ПО Номер.Ссылка = Цены.НомернойФонд
	   |ГДЕ       |	Бронь.НомернойФонд ЕСТЬ NULL       |	И Номер.КоличествоГостей >= &КоличествоГостей";        Запрос.УстановитьПараметр("ДатаЗаезда", Объект.ДатаЗаезда);    Запрос.УстановитьПараметр("ДатаВыезда", Объект.ДатаВыезда);    Запрос.УстановитьПараметр("КоличествоГостей", Объект.КоличествоГостей);	    Выборка = Запрос.Выполнить().Выбрать();        Пока Выборка.Следующий() Цикл        Строка = Объект.СвободныеНомера.Добавить();        Строка.Номер = Выборка.Ссылка;        Строка.Категория = Выборка.Категория;        Строка.Этаж = Выборка.Этаж;        Строка.Вместимость = Выборка.КоличествоГостей;	Строка.Цена = Выборка.Цена;    КонецЦикла;    КонецПроцедуры


&НаКлиенте
Процедура СвободныеНомераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если НЕ Объект.Проведен Тогда	
		ВыбраннаяСтрокаТаблицы = Элементы.СвободныеНомера.ТекущиеДанные;
    // Заполняем данные документа
		Объект.НомернойФонд = ВыбраннаяСтрокаТаблицы.Номер;
    	Объект.Цена = ВыбраннаяСтрокаТаблицы.Цена;
    
    // Переключаемся на основную страницу
   	 Элементы.Страницы.ТекущаяСтраница = Элементы.Основное;
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура СписокУслугВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ВыбраннаяСтрокаТаблицы = Элементы.СписокУслуг.ТекущиеДанные;
	
	НоваяСтрока = Объект.ДополнительныеУслуги.Добавить();
	НоваяСтрока.Услуга = ВыбраннаяСтрокаТаблицы.Услуга;
	НоваяСтрока.Цена = ВыбраннаяСтрокаТаблицы.Цена; 
	
    // Переключаемся на основную страницу
   	 Элементы.Страницы.ТекущаяСтраница = Элементы.Основное;
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗаездаПриИзменении(Элемент)
	РассчитатьКоличествоДней()
КонецПроцедуры 


&НаКлиенте
Процедура ДатаВыездаПриИзменении(Элемент)
	РассчитатьКоличествоДней()
КонецПроцедуры


&НаКлиентеПроцедура РассчитатьКоличествоДней()        // Проверяем что обе даты заполнены    Если НЕ ЗначениеЗаполнено(Объект.ДатаЗаезда)        ИЛИ НЕ ЗначениеЗаполнено(Объект.ДатаВыезда) Тогда        Объект.КоличествоДней = "0";        Возврат;    КонецЕсли;        // Вычисляем разницу в днях    Разница = Объект.ДатаВыезда - Объект.ДатаЗаезда;        // Если разница отрицательная или 0    Если Разница <= 0 Тогда        Объект.КоличествоДней = "0";    Иначе        Объект.КоличествоДней = Разница / (60*60*24);    КонецЕсли;    КонецПроцедуры


