  // Заполняет список команд печати.
// 
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Счет на оплату (СКД)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_СчетЗаказ";
	КомандаПечати.Представление = НСтр("ru = 'Счет на оплату'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь; // важно для теста
	                                     
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	// печать счета на оплату
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_MXL_СчетЗаказ");
	Если ПечатнаяФорма <> Неопределено Тогда
					
				УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм, 
				"ПФ_MXL_СчетЗаказ", 
				"Счет на оплату",
				НапечататьСчетНаОплату(МассивОбъектов, ОбъектыПечати, ПараметрыПечати), ,
				"ПФ_MXL_СчетЗаказ");

	КонецЕсли;
		
КонецПроцедуры

Функция НапечататьСчетНаОплату(МассивОбъектов, МакетИДанныеОбъекта, ИмяМакета) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПФ_MXL_СчетЗаказ";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ПФ_MXL_СчетЗаказ");
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать
	|	Банк.Наименование КАК БанкПолучателяПредставление,
	|	Банк.ИНН КАК ИННПолучателя,
	|	Банк.КПП КАК КПППолучателя,
 	|	Банк.ПредставлениеПолучателя КАК ПредставлениеПолучателя,
 	|	Банк.БИК КАК БИКБанкаПолучателя,
 	|	Банк.СчетБанкаПолучателя КАК СчетБанкаПолучателяПредставление,
 	|	Банк.СчетПолучателя КАК СчетПолучателяПредставление
 	|ИЗ
	|	Справочник.Банк КАК Банк
 	|ГДЕ
	|	Банк.ТекущийБанкРасчета = ИСТИНА";

	Выборка = Запрос.Выполнить().Выбрать();
	ЗаголовокСчета = Макет.ПолучитьОбласть("ЗаголовокСчета");
	
    Если Выборка.Следующий() Тогда
		ЗаголовокСчета.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(ЗаголовокСчета);
	КонецЕсли;
    Заголовок = Макет.ПолучитьОбласть("Заголовок"); 	Заголовок.Параметры.ТекстЗаголовка = "Счет на оплату";	ТабличныйДокумент.Вывести(Заголовок); 
	
	Поставщик = Макет.ПолучитьОбласть("Поставщик"); 
	Поставщик.Параметры.ПредставлениеПоставщика = "ООО 'Точка Останова'";
	ТабличныйДокумент.Вывести(Поставщик);
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Бронирование.Клиент КАК ПредставлениеПокупателя,
		|	Бронирование.Сумма КАК Сумма,
		|	Бронирование.Менеджер КАК Менеджер,
		|	Бронирование.Статус КАК Статус,
		|	Бронирование.Источник КАК Источник,
		|	Бронирование.Цена КАК Цена,
		|	Бронирование.ДополнительныеУслуги.(
		|		Услуга КАК Услуга,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК ДополнительныеУслуги,
		|	Бронирование.Ссылка КАК Основание,
		|	Бронирование.НомернойФонд КАК НомернойФонд,
		|	Бронирование.КоличествоДней КАК КоличествоДней
		|ИЗ
		|	Документ.Бронирование КАК Бронирование
		|ГДЕ
		|	Бронирование.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
		
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Покупатель = Макет.ПолучитьОбласть("Покупатель"); 
	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Строка = Макет.ПолучитьОбласть("Строка");
	СкидкаПоДокументу =  Макет.ПолучитьОбласть("СкидкаПоДокументу");
    Итого = Макет.ПолучитьОбласть("Итого");
	ИтогоНДС = Макет.ПолучитьОбласть("ИтогоНДС");
	ИтогоКОплате = Макет.ПолучитьОбласть("ИтогоКОплате");
	СуммаПрописью = Макет.ПолучитьОбласть("СуммаПрописью");
	СрокОплаты = Макет.ПолучитьОбласть("СрокОплаты");
    ПодвалЗаказа = Макет.ПолучитьОбласть("ПодвалЗаказа");
	ДополнительныеУсловия = Макет.ПолучитьОбласть("ДополнительныеУсловия"); 
	
	НомерСтроки = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		Покупатель.Параметры.Заполнить(ВыборкаДетальныеЗаписи); 
		ТабличныйДокумент.Вывести(Покупатель);
		
		ТабличныйДокумент.Вывести(ШапкаТаблицы);
		
		Сумма = ВыборкаДетальныеЗаписи.Сумма; 

		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.НомернойФонд) Тогда 
			
						Строка.Параметры.НомерСтроки = НомерСтроки;			Строка.Параметры.Артикул = "Номер: " + ВыборкаДетальныеЗаписи.НомернойФонд;			Строка.Параметры.Товар = "Номер в гостинице";			Строка.Параметры.Количество = ВыборкаДетальныеЗаписи.КоличествоДней;			Строка.Параметры.ЕдиницаИзмерения = "шт";			Строка.Параметры.Цена = ВыборкаДетальныеЗаписи.Цена;			Строка.Параметры.СуммаСкидки = "0";			Строка.Параметры.Сумма = Сумма; 
			ТабличныйДокумент.Вывести(Строка);			НомерСтроки = НомерСтроки + 1;		КонецЕсли;
		
		
		ВыборкаУслуги = ВыборкаДетальныеЗаписи.ДополнительныеУслуги.Выбрать();		Пока ВыборкаУслуги.Следующий() Цикл			Строка.Параметры.НомерСтроки = НомерСтроки;			Строка.Параметры.Артикул = ВыборкаУслуги.Услуга;
			Строка.Параметры.Товар = "Услуга";
			Строка.Параметры.Количество = ВыборкаУслуги.Количество;
			Строка.Параметры.ЕдиницаИзмерения = "шт";
			Строка.Параметры.Цена = ВыборкаУслуги.Цена;
			Строка.Параметры.СуммаСкидки = "0%";
			Строка.Параметры.Сумма = ВыборкаУслуги.Сумма;
			ТабличныйДокумент.Вывести(Строка);			НомерСтроки = НомерСтроки + 1;		КонецЦикла;
	
        СкидкаПоДокументу.Параметры.СуммаСкидки = 0;
		ТабличныйДокумент.Вывести(СкидкаПоДокументу);  
		
		Итого.Параметры.Всего = Сумма;
		ТабличныйДокумент.Вывести(Итого); 
		
		СтавкаНДС = 20; 			ИтогоНДС.Параметры.ВсегоНДС = Сумма * СтавкаНДС / (100 + СтавкаНДС);	
		ТабличныйДокумент.Вывести(ИтогоНДС); 
		
		ИтогоКОплате.Параметры.ИтогоКОплате = Сумма;
		ТабличныйДокумент.Вывести(ИтогоКОплате);   
		
		СуммаПрописью.Параметры.ИтоговаяСтрока = Сумма;  
		ПараметрыВалюты = "L=ru_RU; SN=true";		СуммаПрописью.Параметры.СуммаПрописью = ЧислоПрописью(Сумма, ПараметрыВалюты, "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");	
		ТабличныйДокумент.Вывести(СуммаПрописью); 
		

		СрокОплаты.Параметры.СрокОплаты = Формат(ТекущаяДата() + 7 * 24 * 60 * 60, "ДЛФ=DD");
		ТабличныйДокумент.Вывести(СрокОплаты); 
		
		ДополнительныеУсловия.Параметры.ТекстДополнительныхУсловий = "";
		ТабличныйДокумент.Вывести(ДополнительныеУсловия);
		
		ПодвалЗаказа.Параметры.ФИОЗаказчика = ВыборкаДетальныеЗаписи.ПредставлениеПокупателя; 
		ПодвалЗаказа.Параметры.ФИОИсполнителя = ВыборкаДетальныеЗаписи.Менеджер;
		ТабличныйДокумент.Вывести(ПодвалЗаказа);

				
	КонецЦикла;	
    
	
	Возврат ТабличныйДокумент;	
	
КонецФункции  

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
	Настройки.ПриДобавленииКомандПечати = Истина;
	Настройки.ПриОпределенииПолучателей = Истина;
	
КонецПроцедуры
