

Процедура ОбработкаПроведения(Отказ, Режим)
	
	СтатусНомера = ПроверитьСвободныеДаты(НомернойФонд, ДатаЗаезда, ДатаВыезда);
		Если СтатусНомера = Перечисления.ВариантыБронирований.ПроведенДругимДокументом Тогда		Сообщить("Номер занят на выбранные даты!");		Отказ = Истина;		Возврат;	КонецЕсли;   
	
	Если СтатусНомера = Перечисления.ВариантыБронирований.ПроведенТекущимДокументом Тогда
		// регистр ВзаиморасчетыСКлиентами Расход
		ПроведениеВзаиморасчетовСКлиентами()
	КонецЕсли;
	
	Если СтатусНомера = Перечисления.ВариантыБронирований.НомерПустой Тогда  
		
		Движения.БронированиеНомернойФонд.Записывать = Истина;
		ТекущаяДата = ДатаЗаезда;
		
		Пока ТекущаяДата <= ДатаВыезда Цикл
			НоваяЗапись = Движения.БронированиеНомернойФонд.Добавить();
			НоваяЗапись.Дата = ТекущаяДата;
			НоваяЗапись.Документ = Ссылка;
			НоваяЗапись.НомернойФонд = НомернойФонд;       
			НоваяЗапись.Забронировано = ИСТИНА;            
			ТекущаяДата = ТекущаяДата + 60 * 60 * 24;
		КонецЦикла;
		
		ПроведениеВзаиморасчетовСКлиентами()
		
	КонецЕсли;
		КонецПроцедуры

Процедура ПроведениеВзаиморасчетовСКлиентами()
  	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Документ = Ссылка;
	Движение.Клиент = Клиент;
	Движение.Сумма = Сумма;

КонецПроцедуры

Функция ПроверитьСвободныеДаты (НомернойФонд, ДатаЗаезда, ДатаВыезда)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БронированиеНомернойФонд.Дата КАК Дата,
		|	БронированиеНомернойФонд.НомернойФонд КАК НомернойФонд,
		|	БронированиеНомернойФонд.Забронировано КАК Забронировано,
		|	БронированиеНомернойФонд.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.БронированиеНомернойФонд КАК БронированиеНомернойФонд
		|ГДЕ
		|	БронированиеНомернойФонд.НомернойФонд = &НомернойФонд
		|	И БронированиеНомернойФонд.Дата >= &ДатаЗаезда
		|	И БронированиеНомернойФонд.Дата <= &ДатаВыезда
		|	И БронированиеНомернойФонд.Забронировано = &Истина";
	
	Запрос.УстановитьПараметр("ДатаВыезда", ДатаВыезда);
	Запрос.УстановитьПараметр("ДатаЗаезда", ДатаЗаезда);
	Запрос.УстановитьПараметр("Истина", Истина);
	Запрос.УстановитьПараметр("НомернойФонд", НомернойФонд);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Перечисления.ВариантыБронирований.НомерПустой;
    КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
			
		Если Выборка.Документ <> Ссылка Тогда
		Возврат Перечисления.ВариантыБронирований.ПроведенДругимДокументом; 
		КонецЕсли; 
	
	КонецЦикла;
		
    Возврат Перечисления.ВариантыБронирований.ПроведенТекущимДокументом;
		
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции;

 