
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.НачислениеЗарплаты") Тогда
		
		// Один запрос, который сразу суммирует все начисления
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Начисления.Сотрудник,
		|	СУММА(Начисления.Результат) КАК Сумма
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОсновныеНачисления.Сотрудник,
		|		ОсновныеНачисления.Результат
		|	ИЗ
		|		РегистрРасчета.ОсновныеНачисления КАК ОсновныеНачисления
		|	ГДЕ
		|		ОсновныеНачисления.Регистратор = &Регистратор
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ДополнительныеНачисления.Сотрудник,
		|		ДополнительныеНачисления.Результат
		|	ИЗ
		|		РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
		|	ГДЕ
		|		ДополнительныеНачисления.Регистратор = &Регистратор) КАК Начисления
		|
		|СГРУППИРОВАТЬ ПО
		|	Начисления.Сотрудник";
		
		Запрос.УстановитьПараметр("Регистратор", ДанныеЗаполнения);
		Результат = Запрос.Выполнить();
		
		// Очищаем и заполняем табличную часть
		ЭтотОбъект.Сотрудники.Очистить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ЭтотОбъект.Сотрудники.Добавить();
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			НоваяСтрока.Сумма = Выборка.Сумма;
		КонецЦикла;
		
	КонецЕсли;КонецПроцедуры

	Процедура ОбработкаПроведения(Отказ, Режим)
		//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

		// регистр Хозрасчетный 
		Движения.Хозрасчетный.Записывать = Истина;
		Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.СчетДт = ПланыСчетов.Хозрасчетный.СтатьиЗатрат;
			Движение.СчетКт = ПланыСчетов.Хозрасчетный.Сотрудники;
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаСотрудники.Сумма;
			Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетный.СтатьиЗатрат] = СтатьяЗатрат;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетный.Сотрудник] = ТекСтрокаСотрудники.Сотрудник;
		КонецЦикла;

		//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	КонецПроцедуры
